<template>
    <el-dialog title="e农平台合作协议"  width="1000px" :visible.sync="lookVisible" :before-close="closeLookProtocol">
        <div style="overflow-y: auto;height: 600px;">
            <el-form ref="ruleForm" label-width="0px" onsubmit="return false">
                <div class="login-form_2" style="overflow-y: auto;">
                    <div class="title_4" align="center">e农平台合作协议<br>
                        <span>(V4.0版本公示时间2019年1月1日)</span>
                    </div>
                    <div class="content_text">
                        <span class="title_4" style="font-size: 16px;">签约须知：</span><br>
                        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;《e农平台合作协议》（以下简称“本协议”）是由e农网站（即www.e-nongye.com.cn或e农根据业务需要不时修改的包括但不限于计算机或移动设备互联网的URL）及客户端、e农APP及e农微信商城（以下简称“e农”）的运营方即华农（北京）电子商务有限公司（以下简称“甲方”）与以独立第三方经营者身份入驻e农的法律实体（以下简称“乙方”或“商户”）达成的关于提供和使用e农平台服务的各项条款。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;甲方在此特别提醒商户认真阅读本协议各条款（对于本协议中以加粗字体显示的内容，应重点阅读），并请商户审慎考虑并选择接受或不接受本协议。如果商户点击“我已经阅读并同意”按钮（前述按钮的具体表述可能会做适当调整，下同），即表示商户已充分阅读、理解并自愿接受本协议，同意受本协议各项条款的约束。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;本“签约须知”为本协议正文的组成部分。
                    </div>
                    <div class="content_text">
                        <span class="title_4" style="font-size: 16px;">定义及释义：</span><br>
                        <span class="title_4" style="font-size: 16px;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;如无特别说明，下列用语在本协议中的定义为：</span><br>
                        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“e农平台”：指甲方提供互联网信息服务及相关软件、技术支持的e农网站（即www.e-nongye.com.cn或e农根据业务需要不时修改的包括但不限于计算机或移动设备互联网的URL）及客户端、e农APP及e农微信商城（以下简称“e农”）及客户端。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“商户”：指在e农平台经营商品或服务的法律实体。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“消费者”：指在e农平台进行购物并用于生产、消费的任何自然人或组织，亦可称为“买家”。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“规则”：指所有e农平台内已发布及后续发布的全部规则、实施细则、解读、产品流程说明、公告等。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“入驻标准”：指商户使用e农平台服务须满足的前提，如企业注册资本、商标注册情况等。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“服务”：是指由甲方在e农平台向商户提供的互联网信息服务及与此相关的软件服务、二级域名服务、积分系统软件服务等。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“服务开通”：指商户登陆e农网站并完成信息提交、协议签署、费用缴纳后，经审查通过，e农允许商户于天猫开设网络店铺、使用天猫服务并对商户进行通知的过程。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“考核标准”：指甲方为提升消费者体验及平台商户经营能力而从品牌、店铺等多维度针对商户进行经营考核所制定的相关指标等标准。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“金融服务商”：经相关部门批准并依法设立的金融机构或金融服务机构。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;上述e农平台商户（以下行文中有时以您表示，您不仅包含平台客户端的阅读、使用、操作人员，而且包括法人或个体工商户的法定代表人和其工作人员）的所有在e农平台上行为都应遵守本协议的约定。
                    </div>
                    <div class="content_text">
                        <span class="title_4" style="font-size: 16px;">1.0 协议内容及生效：</span><br>
                        1.1 本协议包括协议正文、附件及所有甲方已经发布的或将来可能发布的各类规则、规范、规则解读、实施细则、通知、公告等（以下合称“规则”）。所有附件及规则均为本协议的组成部分，与协议正文具有同等法律效力。协议正文、附件与规则冲突的，以发布时间在后的文件为准执行。
                        <br>1.2  甲方有权根据需要变更（包括但不限于制定、修改、废止等）本协议正文、附件及/或规则，并提前7日在甲方网站公示，乙方应当实时关注公示内容。如乙方点击“我已经阅读并同意”按钮，本协议正文及/或附件将于甲方公示次日起的第8日零时生效。如乙方点击“暂不同意”按钮，则乙方店铺将进入“关店准备”状态，店铺内商品将全部下架，无法上架新商品。乙方清楚知晓、同意并确认前述“关店准备”状态下的店铺功能限制。如乙方点击“暂不同意”按钮或不同意规则变更的，乙方应于甲方公示次日起的7日内书面通知甲方终止本协议，则本协议于甲方收到乙方书面通知之日起终止，甲方对于该等终止不负有任何违约责任或其他责任。如乙方未按前述约定向甲方提出终止本协议，即视为乙方接受前述变更后的本协议正文、附件及/或规则（下称“变更事项”），该等变更事项将于甲方公示次日起的第8日零时生效。
                        <br>1.3  商户首次申请入驻e农平台时，签署或在线接受本协议后，本协议立即生效，但本协议项下的平台服务并不立即开通，商户根据平台要求履行上传相关资质、支付保证金等义务，经甲方审核通过并向商户发出服务开通通知（通知方式包括但不限于站内信、手机短信等）时，本协议项下的平台服务正式开通。
                        <br><span class="title_4" style="font-size: 16px;">2.0 资格要求、证明文件及信息：</span><br>
                        2.1 资格要求：商户保证具有履行本协议所需的行为能力及所有必要资质和授权。
                        <br>2.2 证明文件及信息提交：商户应当根据甲方要求向甲方或甲方指定商户提交其在申请服务时应当提供的证明文件及联系人、联系地址、联系电话、联系邮箱等信息。
                        <br>2.3 证明文件及信息变更的通知：协议期内，上述相关证明文件及信息的任何变更商户都应及时通知甲方，如上述证明文件及信息变更后导致商户不再符合甲方入驻标准，或不再具备履行本协议的能力时，甲方有权立即中止/解除本协议。
                        <br>2.4 甲方有权根据商户提交、修改或更新的相关信息、提现银行账户及证明文件，对商户店铺类型做出判断及/或变更，并有权根据店铺类型决定对商户具体适用的平台规则，商户同意遵守前述对其适用的平台规则。
                        <br>2.5 甲方有权对商户提供的证明文件及信息进行不定时的抽查，并有权要求商户提供证明文件原件供核对或提供更多证明文件、信息，商户应当按甲方要求提供。如商户不能提供，则甲方有权立即中止/解除本协议。
                        <br>2.6 商户无条件并不可撤销地授权甲方及其他相关合作方（包括但不限于合作金融机构）查询并核验商家信息，包括但不限于征信信息、身份信息、联系信息等，并同意甲方与相关合作方共享上述信息。
                        <br>2.7 责任条款：商户保证其向甲方及其他相关商户提供的全部文件及信息全面、真实、准确、合法、有效，商户提供虚假、过期、失效文件或信息，或未及时通知并更新其文件或信息的，应独立承担全部法律责任。如由此导致商户不符合甲方入驻标准或不再具备履行本协议的能力的，甲方有权立即中止/解除本协议。如给甲方（包括其合作伙伴、代理人、职员等）或其他任何第三方造成损失的，商户同意赔偿其全部损失，且甲方有权立即解除本协议。
                        <br><span class="title_4" style="font-size: 16px;">3.0 合作方式：</span><br>
                        3.1 商户根据平台要求完成入驻后，将会获得相应店铺后台的账户及密码，商户在遵守本协议及平台规则、不存在违约情形的前提下，可以通过后台进行店铺日常经营。若商户存在违约行为，平台有权根据相应平台规则限制商户后台的部分或全部功能。
                        <br>3.2 商户在e农设立店铺，直接销售商品（包括服务，下同）给消费者。开店成功后，商户可根据甲方系统规则安排产品上线销售。商户应当根据法律、法规及甲方要求制作商品相关素材、提供售前售后服务、提供商品送货服务，双方另有约定或甲方平台规则另有规定的除外；同时商户应依法为消费者开具正规的商品发票，相关税费由商户自行承担。
                        <br>3.3 除双方另有约定外，甲方有权根据商品销量、商品价格、商户的服务水平等因素单方调整商品的展示位置。
                        <br>3.4 商户充分理解并确认，甲方有权收取平台相关费用，具体收费标准以本协议约定或平台规则为准。
                        <br>3.5 甲方负责e农平台的日常维护、技术支持，保证平台的正常运作。作为电子商务平台经营者，甲方仅为商户与消费者达成交易提供网页空间、虚拟经营场所、交易规则等服务，甲方并非商户与消费者之间交易行为的参与方，不对商户及/或消费者的任何口头、书面陈述或承诺，发布的信息及交易行为的合法性、真实性、及时性、准确性、有效性等作任何明示或暗示的保证，亦不承担任何法律责任。
                        <br>3.6  商户无条件并不可撤销地授权甲方通知其他相关商户（包括但不限于合作银行等）按年扣取技术服务费，或者自每笔销售货款中直接扣除相应的技术服务费，技术服务费结算方式为按每笔订单金额计收，结算数据以e农平台系统记录为准。订单发生退款的，退款时不另行收取技术服务费，但已收取的技术服务费不做退还。甲方有权根据行业发展等情况单方面调整年度技术服务费、技术服务费费率及/或结算方式并在平台上予以公布，自公布之日起适用新的费率标准及/或结算方式。
                        <br><span class="title_4" style="font-size: 16px;">4.0 商品交付：</span><br>
                        4.1 商户应当根据甲方平台规则（包括但不限于《e农发货规则》）及时将商品交付消费者。
                        <br>4.2 商户应按对消费者的承诺及甲方要求（如有）对商品进行包装，包装费用由商户承担。商户在包装中不得夹带任何违反法律法规或本协议约定的资料、宣传单等，不得出现任何非甲方的第三方网站或店铺信息等。
                        <br>4.3 甲方有权根据平台规则对商户延迟发货、虚假发货、缺货、欺诈发货等违规行为进行处理，相关定义及违规判定、处理方式以平台规则的规定为准。
                        <br><span class="title_4" style="font-size: 16px;">5.0 商品质量保证：</span><br>
                        5.1 商户保证所售商品符合《中华人民共和国产品质量法》等法律法规、规章、相关国家标准，行业标准、本协议约定及甲方相关平台规则之规定（包括但不限于商品安全性，商品功能材质、标识标志、外观、包装与描述符合性等）。
                        <br>5.2 商户保证向消费者提供有关商品信息真实，如实描述，不做引人误解的虚假宣传，不存在发布虚假广告、欺诈和误导消费者等行为。
                        <br>5.3 商户保证所售商品均为正牌商品，商品来源真实、合法，未侵犯他人商标专用权、专利权、著作权或其他合法权益，不存在伪造商品产地，伪造或冒用他人厂名、厂址、认证标志、质量标志、名优标志、包装装潢等行为。
                        <br>5.4 商户保证销售的所有商品清洁、整齐、包装完好、适宜销售，送货时不存在任何包装破损或潮湿、变色。凡有保质期的商品，在送达消费者订单指定收货地时均在保质期内。对于临近保质期的商品，商户应在商品页面的显著位置作出说明。商户违反以上规定应承担相应违约责任，赔偿消费者及/或甲方因此遭受的损失。
                        <br>5.5 商户保证销售的所有商品及吊牌、商品外包装上，不存在任何之前在其他商场或任何渠道销售的标志、价格。如商户对商品之前的价格标签未作处理或出现价格标签重叠、错粘及其他足以影响甲方商业信誉的标志及瑕疵，商户应当为甲方消除影响并承担赔偿责任。如因此造成甲方对第三人承担任何法律责任，甲方有权向商户追偿。
                        <br>5.6 商户销售的商品不符合本协议约定的，视为不合格商品，因商户销售不合格商品，消费者有权将该商品退回商户，运费由商户承担，造成甲方或消费者任何损害（包括人身和财产损失及甲方声誉损失），商户应当承担赔偿责任。
                    </div>
                </div>
            </el-form>
        </div>
        <div class="bottom_protocol" align="right">
            <el-button class="el-button_2" type="primary" style="width: 150px;" @click="closeLookProtocol">取消</el-button>
            &nbsp;&nbsp;&nbsp;
            <el-button class="el-button_2" type="primary" style="width: 150px;" @click="successEvent">同意并继续</el-button>
        </div>
    </el-dialog>
</template>

<script>
    export default {
        data() {
            return {
            }
        },
        props:{
            lookVisible:Boolean,
        },
        methods: {
            successEvent(){
                this.$emit('closeLookProtocol')
                this.$emit('agreeProtocol','1')
            },
            closeLookProtocol(){
                this.$emit('closeLookProtocol')
            }
        }
    }
</script>

<style>
    .title_4 {
        font-family:'微软雅黑 Bold', '微软雅黑 Regular', '微软雅黑';
        font-weight:700;
        font-style:normal;
        font-size:20px;
        line-height:36px;
        color:#666666;
    }
    .content_text {
        font-family:'微软雅黑';
        font-weight:400;
        font-size:14px;
        color:#666666;
        text-align:left;
        line-height:30px;
    }
    .el-button_2{
        width:80px;
        height: 35px;
        padding:10px 20px;
        border-radius: 2px;
    }
    .bottom_protocol{
        padding-top: 30px;
        padding-right: 50px;
        padding-bottom: 10px;
    }
</style>